# Data Cleansing

Data cleansing is not the most exciting aspect of work in the data analytics space, but it can be one of the most influential. Properly formatting and preprocessing our data can mean the difference between a well-constructed analysis and a blatantly false one. Unfortunately, there is no one-size-fits-all approach to this task, as each analysis relies on different datasets with varying levels of "messiness". Below are just a few examples of what can be done to clean up some messy data.

## Objectives:
- Investigate null values
- Change data type of dataframe column
- Harmonize variations of the same categorical value

#### Import dependencies

In [15]:
import pandas as pd
import os

#### Read the donors csv and display the first few rows

**IMPORTANT NOTE:** In the `read_csv()` function, I'm including an argument for `dtype=str`. This is telling pandas to read all columns in as strings. I'm only doing this so I can show you how to change the `Amount` column to numeric later in this notebook. You will not include this `dtype=str` argument in any of your notebooks unless you want to predefine all datatypes.

In [16]:
file = os.path.join("..", "Resources", "donors2008.csv")

# The correct encoding must be used to read the CSV in pandas
df = pd.read_csv(file, encoding="ISO-8859-1", dtype=str)
df.head()

  LastName FirstName          Employer      City State    Zip Amount FIELD8
0    Aaron    Eugene  State Department    Dulles    VA  20189    500    NaN
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021    200    NaN
2  Adamany   Anthony           Retired  Rockford    IL  61103    500    NaN
3    Adams  Lorraine              Self  New York    NY  10026    200    NaN
4    Adams    Marion              None    Exeter    NH  03833    100    NaN

___

## Handling Null Values

From the output above, we can already see that we may have a problem with the *FIELD8* column, but let's thoroughly investigate.

#### Identify which columns contain null values

In [17]:
df.isnull().any()

LastName     False
FirstName    False
Employer      True
City         False
State        False
Zip          False
Amount       False
FIELD8        True
dtype: bool

#### Identify how with complete each column is

At this point, we can confirm that **FIELD8** doesn't actually contain any data, so it should be safe to delete.

In [18]:
df.count()

LastName     1776
FirstName    1776
Employer     1743
City         1776
State        1776
Zip          1776
Amount       1776
FIELD8          0
dtype: int64

#### Delete extraneous column

In [19]:
del df['FIELD8']
df.head()

  LastName FirstName          Employer      City State    Zip Amount
0    Aaron    Eugene  State Department    Dulles    VA  20189    500
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021    200
2  Adamany   Anthony           Retired  Rockford    IL  61103    500
3    Adams  Lorraine              Self  New York    NY  10026    200
4    Adams    Marion              None    Exeter    NH  03833    100

___
# Is it necessary to investigate further? 
### It depends on our intentions
___

#### Look at the rows that contain at least one null value

In [20]:
df.isnull().any(axis=1)

0       False
1       False
2       False
3       False
4       False
        ...
1771    False
1772     True
1773     True
1774    False
1775    False
Length: 1776, dtype: bool

#### Investigate the rows with null values

In [21]:
# Shows the rows with nulls and allows you to investigate
df[df.isnull().any(axis=1)]

          LastName FirstName Employer           City State         Zip Amount
13           Ahuja  Maria T.      NaN       New York    NY       10021   1000
126         Berger   Harriet      NaN   Philadelphia    PA       19129   5000
149          Block    Milton      NaN         Naples    NY       14512    200
400        Donelan     Myrna      NaN         Durham    NC  27707-5711    250
460          Faber   Suzanne      NaN        Chicago    IL       60611   5000
491        Fizdale   Richard      NaN        Chicago    IL       60611   5000
519        Fritsch   Claudia      NaN        Atlanta    GA       30319    250
543        Gaylord   Marilyn      NaN          Lacey    WA  98503-2547     50
566        Gilbert   Barbara      NaN  Nicholasville    KY       40356    100
608         Graves     Scott      NaN      Arlington    VA       22201     50
619      Griesbach     Marga      NaN     Silverdale    WA       98383    200
653         Hansen       Tom      NaN   Blue Springs    MO       64015    100
756       Ilyinsky   Michael      NaN     Cincinnati    OH       45243    250
915         Lawson     Peter      NaN    Valley Ford    CA  94972-0563    200
960            Low     Dixon      NaN        Roanoke    VA       24018    250
988        Manilow     Lewis      NaN        Chicago    IL       60610   5000
995   Mardirossian  Marianne      NaN        Potomac    MD       20859   5000
1057      Mcmorris    Bertha      NaN        Chicago    IL       60637   5000
1124        Nadeau      Bart      NaN  San Francisco    CA       94131    200
1226      Peterson     James      NaN        Shawnee    KS       66216    250
1311    Richardson       Jon      NaN           York    ME       03909    200
1362          Ryan   Melanie      NaN        Gahanna    OH       43230    100
1416         Seyal      Sara      NaN       Prospect    KY       40059    100
1459       Skinner     Nancy      NaN  Newport Beach    CA       92660     50
1621    Vail Aycox    Leslie      NaN     Alpharetta    GA       30022   5000
1689       Welters  Beatrice      NaN         Mclean    VA       22101   5000
1704      White Jr     Frank      NaN  Silver Spring    MD       20904   5000
1707       Whitney      John      NaN    Los Angeles    CA       90035    200
1713         Wilde  Margaret      NaN       Eatonton    GA       31024    500
1718        Willis      Mary      NaN        Langley    WA       98260    200
1736          Wolf   Michael      NaN       New York    NY       10013   5000
1772    Zschiesche     Peter      NaN      San Diego    CA       92104    250
1773    Zweidinger      Ruth      NaN   Hillsborough    NC       27278    250

#### Drop all rows with missing information

**BE CAREFUL WITH THIS**

In [22]:
df = df.dropna()
# how = all only drops rows if all values in row are null
#df = df.dropna(how = "all")

#### Verify dropped rows

In [23]:
df.count()

LastName     1743
FirstName    1743
Employer     1743
City         1743
State        1743
Zip          1743
Amount       1743
dtype: int64

___
## Handling Incorrect Data Types

Pandas is pretty good at inferring the datatypes in your data files, but sometimes it gets this wrong. Below we'll look at how we can change the datatype for a particular column.

#### The *Amount* column is the wrong data type

In [24]:
df.dtypes

LastName     object
FirstName    object
Employer     object
City         object
State        object
Zip          object
Amount       object
dtype: object

#### Use `pd.to_numeric()` method to convert the datatype of the *Amount* column

In [27]:
df['Amount'] = pd.to_numeric(df['Amount'])

#### Verify that the *Amount* column datatype has been made numeric

In [28]:
df.dtypes

LastName      object
FirstName     object
Employer      object
City          object
State         object
Zip           object
Amount       float64
dtype: object

___
# Normalizing Categorical Values
Oftentimes poorly governed data sources will have multiple variations of categorical values. This can cause issues with us underrepresenting a particular subset of our data unless we take action to clean this up. Below we'll see how we can merge variations of these values into a single instance.

#### Display an overview of the *Employer* column

In [32]:
df['Employer'].value_counts().head(25)

None                              249
Self                              241
Retired                           126
Self Employed                      39
Self-Employed                      34
Google                              6
Unemployed                          4
Not Employed                        4
University of California            3
Social Security Administration      3
Bank Of America                     3
Newton Public Schools               2
LMI                                 2
Kaiser Permanente                   2
State Department                    2
Mayer Brown                         2
Northern Trust                      2
Berger & Montague                   2
Federal Government                  2
UCLA                                2
Freelance                           2
University Hospital                 2
Davis Polk & Wardwell               2
United Health Group                 2
Sidley Austin LLP                   2
Name: Employer, dtype: int64

#### Clean up *Employer* category. Replace *'Self Employed'* and *'Self'* with *'Self-Employed'*

In [33]:
#takes in a dictionary

df['Employer']=df['Employer'].replace({"Self Emplyed":"Self-Employed","Self":"Self-Employed"})

#### Verify clean-up

In [34]:
df['Employer'].value_counts().head(25)

Self-Employed                     275
None                              249
Retired                           126
Self Employed                      39
Google                              6
Unemployed                          4
Not Employed                        4
University of California            3
Social Security Administration      3
Bank Of America                     3
United Health Group                 2
Berger & Montague                   2
Kaiser Permanente                   2
Davis Polk & Wardwell               2
University of Michigan              2
Northern Trust                      2
State Department                    2
University Hospital                 2
UCLA                                2
University of Washington            2
Federal Government                  2
Newton Public Schools               2
Covington & Burling                 2
Freelance                           2
Ariel Investments                   2
Name: Employer, dtype: int64

#### Clean up variations of *'Unemployed'*